app/controllers/links_controller.rb

INSERT INTO "links" ("created_at", "updated_at", "url") VALUES (?, ?, ?)  [["created_at", Wed, 08 Aug 2012 18:45:04 UTC +00:00], ["updated_at", Wed, 08 Aug 2012 18:45:04 UTC +00:00], ["url", "dasdasd"]]
SELECT "links".* FROM "links"
---
  def create
    @link = Link.new(params[:link])

    if @link.save
      flash[:notice] = "Successfully created link."
      @links = Link.all

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]
SELECT "links".* FROM "links"
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy
    flash[:notice] = "Successfully destroyed link."
    @links = Link.all