app/controllers/links_controller.rb

SELECT "links".* FROM "links"
---
  def index
    @links = Link.all

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @link = Link.find(params[:id])