app/controllers/static_pages_controller.rb

SELECT "links".* FROM "links"
---
	def home
		@link = Link.new
		@links = Link.all